app/views/clouds/new.html.erb

      <div class="control-group">
	<%= f.collection_select(:ami_id, Ami.all, :imageId, :name) %>
---
SELECT "amis".* FROM "amis"