app/views/control_panel/_instance_actions.html.erb

<% current_user.account.clouds.each do |cloud| %>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "clouds".* FROM "clouds" WHERE (turn_off_at > '2014-10-07 17:25:04')