app/controllers/accounts_controller.rb

SELECT "entitlements".* FROM "entitlements"
---
  def show
    @entitlements = Entitlement.all

UPDATE "accounts" SET "minutes" = 0, "instance_limit" = 1, "updated_at" = '2014-10-02 14:26:25.735858' WHERE "accounts"."id" = 1
---
  def update
    respond_to do |format|
      if @account.update(account_params)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def set_account
    @account = Account.find(params[:id])