app/controllers/amis_controller.rb

  def index
    @amis = Ami.all
---
SELECT "amis".* FROM "amis"

  def edit
    @ami = Ami.find(params[:id])
---
SELECT "amis".* FROM "amis" WHERE "amis"."id" = ? LIMIT 1  [["id", "1"]]

  def show
    @ami = Ami.find(params[:id])
---
SELECT "amis".* FROM "amis" WHERE "amis"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @ami = Ami.new(ami_params)
    @ami.get_data

    respond_to do |format|
      if @ami.save
---
INSERT INTO "amis" ("created_at", "description", "imageId", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 29 Sep 2014 15:59:17 EDT -04:00], ["description", "stock ubuntu"], ["imageId", "ami-8786c6b7"], ["name", "Ubuntu"], ["updated_at", Mon, 29 Sep 2014 15:59:17 EDT -04:00]]

  def update
    @ami = Ami.find(params[:id])

    respond_to do |format|
      if @ami.update_attributes(ami_params)
---
SELECT "amis".* FROM "amis" WHERE "amis"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "amis" SET "name" = 'Ubuntu', "size" = 't1.micro', "updated_at" = '2014-09-29 17:51:12.533560' WHERE "amis"."id" = 1

  def destroy
    @ami = Ami.find(params[:id])
    @ami.destroy
---
SELECT "amis".* FROM "amis" WHERE "amis"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "amis" WHERE "amis"."id" = ?  [["id", 2]]

  def build
    @cloud = Cloud.find(params[:cloud_id])
    @ami = Ami.new(params[:ami])
    @ami.imageId = @ami.build(@cloud.instance_id)

    respond_to do |format|
      if @ami.save
---
SELECT "clouds".* FROM "clouds" WHERE "clouds"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "amis" ("created_at", "description", "imageId", "name", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?)