app/controllers/clouds_controller.rb

SELECT "clouds".* FROM "clouds"
---
  def index
    @clouds = Cloud.all

SELECT "amis".* FROM "amis"
---
  def new
    @cloud = Cloud.new
    @amis = Ami.all

INSERT INTO "clouds" ("account_id", "ami_id", "created_at", "instance_id", "name", "subnet_id", "turn_off_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cloud = current_user.account.clouds.new(cloud_params)
    @cloud.create_instance(current_user.login, current_user.account.security_group_id)

SELECT "clouds".* FROM "clouds" WHERE "clouds"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "clouds" WHERE "clouds"."id" = ?  [["id", 1]]
---
  def destroy
    @cloud = Cloud.find(params[:id])
    @cloud.terminate
    @cloud.destroy

SELECT "clouds".* FROM "clouds" WHERE "clouds"."id" = ? LIMIT 1  [["id", "3"]]
---
  def start
    @cloud = Cloud.find(params[:id])

SELECT "clouds".* FROM "clouds" WHERE "clouds"."id" = ? LIMIT 1  [["id", "3"]]
---
  def stop
    @cloud = Cloud.find(params[:id])

SELECT "clouds".* FROM "clouds" WHERE "clouds"."id" = ? LIMIT 1  [["id", "13"]]
---
  def reboot
    @cloud = Cloud.find(params[:id])