app/views/accounts/show.html.erb

SELECT "clouds".* FROM "clouds" WHERE "clouds"."account_id" = 1
---
  <tbody>
    <% @account.clouds.each do |cloud| %>